codigo.mensaje.ejemplo=Al lanzar una excepci\u00f3n se puede a\u00f1adir cualquier objeto que se desee.

servicios.archivos.error.escritura=Hubo un error al escribir el archivo: {0} en el directorio: {1}
servicios.archivos.error.lectura=Hubo un error al leer el archivo: {0} en el directorio: {1}
servicios.archivos.error.upload=Hubo un error al subir el archivo: {0}
servicios.archivos.error.directorio.noExiste=El directorio destino {0} no existe.
servicios.archivos.error.directorio.noPermisos.escritura=No se tienen permisos de escritura en el directorio {0};
servicios.archivos.error.directorio.noPermisos.lectura=No se tienen permisos de escritura en el directorio {0};

servicios.catalogo.error.delete.referencia=No fue posible eliminar el registro del cat\u00e1logo solicitado debido a que se encuentra relacionado con otros registros
servicios.catalogo.error.update.referencia=No fue posible actualizar el registro del cat\u00e1logo solicitado
servicios.catalogo.error.save.referencia=No fue posible guardar el registro del cat\u00e1logo solicitado
servicios.parametros.error.update.referencia=No fue posible actualizar el registro del par\u00e1metro solicitado
servicios.siniestro.error.update.referencia=No fue posible actualizar el registro del siniestro solicitado
servicios.reactivar.error.update.referencia=No fue posible reactivar el registro del siniestro solicitado
servicios.util.notificacion.mail.error.1=No fue posible notificar la conclusi\u00f3n/finiquito por correo electr\u00f3nico
servicio.seguimiento.notificacion.origen.error=No fue posible determinar el usuario que ingreso el siniestro en el sistema para el Expediente: {0}
servicio.util.notificacion.mail.error.2=No fue posible notificar la conclusi\u00f3n/finiquito por correo electr\u00f3nico de los siniestros con los n\u00fameros de expediente: {0}
servicio.consulta.ct.clave.no.encontrado=No se encontr\u00f3 informaci\u00f3n del centro de trabajo: {0}
servicio.consulta.ct.criterios.no.encontrado=No se encontr\u00f3 informaci\u00f3n del centro de trabajo con la informaci\u00f3n solicitada
servicio.util.notificacion.mail.error.0=Problemas al enviar el correo electr\u00f3nico con mensaje de error: {0}\nLa notificaci\u00f3n fue canalizada al correo {1} para su posterior reenv\u00edo
servicios.util.notificacion.mail.error.3=No fue posible {0} dado que el correo electr\u00f3nico fue rechazado

servicios.catalogo.error.save.estatus.duplicado=El Id. del estatus ya se encuentra registrado, se cancela operaci\u00f3n para evitar duplicidad.
servicios.catalogo.error.save.ur.duplicado=El identificador de la unidad responsable ya se encuentra registrada, se cancela operaci\u00f3n para evitar duplicidad.
servicios.catalogo.error.save.entidadfed.duplicado=El Id. de la entidad federativa ya se encuentra registrada, se cancela operaci\u00f3n para evitar duplicidad.
servicios.catalogo.error.save.estatusindicido.duplicado=La convinaci\u00f3n de Objetivo-Requisito-Estatus ya se encuentra registrada, se cancela operaci\u00f3n para evitar duplicidad.
servicios.seguridad.usuario.no.delete=Este usuario no se puede eliminar, tiene un rol y/o unidades asignadas
servicios.catalogo.error.save.quincena.duplicado=La quincena ya se encuentra registrada, se cancela operaci\u00f3n para evitar duplicidad.

servicios.catalogo.error.save.dim.duplicado=Los datos de presentaci\u00f3n del DIM del a\u00f1o capturado ya se encuentran registrados, se cancela operaci\u00f3n para evitar duplicidad.
servicios.catalogo.error.delete.dim.duplicado=No fue posible eliminar los datos de presentaci\u00f3n del DIM solicitado.